In [17]:
#----------------------Page One ---------------------------------------------------
import pandas as pd
import numpy as np
from pandas import RangeIndex

# Creating data frames - {array , dictionaries , csv files}

In [3]:
# -----Option 1 -creating a dataframe using a  array-------

# creating an array
data = np.array([[1,4],[2,5],[3,6]])
# creating a data frame
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
                    columns=['col1', 'col2'])
# printing
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

In [4]:
# ------option 2 - creating a df from a Dictionary------

state = ['California','Texas','Florida','New York']
population = [10000 , 20000,30000,40000]

dict_states = {'States':state, 'Population':population}

df_population = pd.DataFrame(dict_states)

df_population

       States  Population
0  California       10000
1       Texas       20000
2     Florida       30000
3    New York       40000

In [7]:
# -----option three  - creating a dataframe using a csv file--------

df_salaries = pd.read_csv("../Assets/annual.csv")

# shows first five rows in a data frame
# head() is defines inside class body
df_salaries.head()

# Add a number inside Parenthesis

# shows last five rows in a dataframe
df_salaries.tail()

#  get the number of rows and columns
df_salaries.shape

,Period,Inst_sector,Inst_sector_code,Descriptor,SNA08TRANS,Asset_liability_code,Values
7747,2023.03,Total all sectors,900,Capital Account Closing balances Total non-fin...,LE00000,AN00000,3017380
7748,2023.03,Total all sectors,900,Capital Account Closing balances Produced non-...,LE00000,AN10000,1440803
7749,2023.03,Total all sectors,900,Capital Account Closing balances Non-produced ...,LE00000,AN20000,1576577
7750,2023.03,Total all sectors,900,Closing balance net worth,LE00000,B900000,3017380
7751,2023.03,Total all sectors,900,Closing balance total liabilities and net worth,LE00000,L000000,7678630

In [10]:
# display n rows
pd.set_option('display.max_rows', 1000)
df_salaries

,Period,Inst_sector,Inst_sector_code,Descriptor,SNA08TRANS,Asset_liability_code,Values
0,2007.03,Non-corporate business enterprises,121,Closing balance total assets,LE00000,A000000,345948
1,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance Total financi...,LE00000,AFA0000,99748
2,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance monetary gold...,LE00000,AFA0100,0
3,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance currency and ...,LE00000,AFA0200,14773
4,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance debt securities,LE00000,AFA0300,1267
...,...,...,...,...,...,...,...
7747,2023.03,Total all sectors,900,Capital Account Closing balances Total non-fin...,LE00000,AN00000,3017380
7748,2023.03,Total all sectors,900,Capital Account Closing balances Produced non-...,LE00000,AN10000,1440803
7749,2023.03,Total all sectors,900,Capital Account Closing balances Non-produced ...,LE00000,AN20000,1576577
7750,2023.03,Total all sectors,900,Closing balance net worth,LE00000,B900000,3017380
7751,2023.03,Total all sectors,900,Closing balance total liabilities and net worth,LE00000,L000000,7678630

In [13]:
#--------------------Attributes-------------------------------

#--Shape - give the numer of columns and rows
df_salaries.shape

(7752, 7)

In [19]:
#--getting index - give the indexes
df_salaries.index

RangeIndex(start=0, stop=7752, step=1)

In [20]:
RangeIndex(start=0, stop=100, step=1)

RangeIndex(start=0, stop=100, step=1)

In [21]:
#--Column - give columns and names
df_salaries.columns

Index(['Period', 'Inst_sector', 'Inst_sector_code', 'Descriptor', 'SNA08TRANS',
       'Asset_liability_code', 'Values'],
      dtype='object')

In [22]:
#--data types - give the data types
df_salaries.dtypes

Period                  float64
Inst_sector              object
Inst_sector_code          int64
Descriptor               object
SNA08TRANS               object
Asset_liability_code     object
Values                   object
dtype: object

In [23]:
#--info() - give info about the dataframe - datatype and not null
df_salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7752 entries, 0 to 7751
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Period                7752 non-null   float64
 1   Inst_sector           7752 non-null   object
 2   Inst_sector_code      7752 non-null   int64
 3   Descriptor            7752 non-null   object
 4   SNA08TRANS            7752 non-null   object
 5   Asset_liability_code  7752 non-null   object
 6   Values                7752 non-null   object
dtypes: float64(1), int64(1), object(5)
memory usage: 424.1+ KB

In [24]:
# describe the basic statistics -
df_salaries.describe()

            Period  Inst_sector_code
count  7752.000000       7752.000000
mean   2015.030000        348.263158
std       4.899295        206.319632
min    2007.030000        121.000000
25%    2011.030000        222.000000
50%    2015.030000        270.000000
75%    2019.030000        400.000000
max    2023.030000        900.000000

In [25]:
#-------------------Functions use in data frames(Pandas)-----------------

# --length of the df () number of rows
len(df_salaries)

7752

In [28]:
#--Highest index of the data frame
max(df_salaries.index)

7751

In [29]:
#--Lowest index of the data frame
min(df_salaries.index)

0

In [30]:
#--Obtaining the data type
type(df_salaries)

pandas.core.frame.DataFrame

In [31]:
#--Rounding the values of the data set
round(df_salaries,2)

,Period,Inst_sector,Inst_sector_code,Descriptor,SNA08TRANS,Asset_liability_code,Values
0,2007.03,Non-corporate business enterprises,121,Closing balance total assets,LE00000,A000000,345948
1,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance Total financi...,LE00000,AFA0000,99748
2,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance monetary gold...,LE00000,AFA0100,0
3,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance currency and ...,LE00000,AFA0200,14773
4,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance debt securities,LE00000,AFA0300,1267
...,...,...,...,...,...,...,...
7747,2023.03,Total all sectors,900,Capital Account Closing balances Total non-fin...,LE00000,AN00000,3017380
7748,2023.03,Total all sectors,900,Capital Account Closing balances Produced non-...,LE00000,AN10000,1440803
7749,2023.03,Total all sectors,900,Capital Account Closing balances Non-produced ...,LE00000,AN20000,1576577
7750,2023.03,Total all sectors,900,Closing balance net worth,LE00000,B900000,3017380
7751,2023.03,Total all sectors,900,Closing balance total liabilities and net worth,LE00000,L000000,7678630